import React, { Component } from 'react';
import { Link } from 'react-router';


export default class News extends Component {

    render() {
        return (
            <div className="content--box">
                <div className="content--title">Новини</div>
                <section>
                    <article className="news--article">
                        <div className="news--title">НАТАЛІЯ КУБА: “ПРОГРАМА ІНТЕРНЕТ РЕЧЕЙ – ШАНС НА
                        ЗМІНИ В ОСВІТІ”</div>
                        <img src="/images/1.jpg" alt="" />
                        <p>Наталія Куба працює керівником відділу навчання і розвитку у SoftServe, входила до
                        робочої групи, яка розробляла бакалаврську програму Інтернет речей (Internet of things)
                        у Львівській політехніці. Це перша пілотна програма, над якою працювали ІТ-спеціалісти
                        спільно з представниками університету. Частково експериментальна. Ми вирішили поговорити
                        з нею про те, чи виправдала програма попередні сподівання і як проходить навчання
                        студентів.</p>
                        <p>На програмі Інтернет речей на спеціальності Комп’ютерні науки в Політехніці навчається 51
                        студент. За 4 роки очікують отримати перших спеціалістів в цьому напрямку, на який існує
                        великий попит на ринку праці.</p>
                        <p><em>«Це люди, які мають стати архітекторами розумних рішень нашого життя назагал. Інтернет
                        речей – це один з найбільш інноваційних напрямків, вміння інтегрувати цифрові рішення в
                        будь-які потреби. Це голубий океан для бізнесу, можливість по-новому опрацьовувати соціальні
                        запити та потреби споживачів. Це люди, які змінюватимуть якість нашого з вами життя, вони
                        будуть рушієм подальшого технічного прогресу, який зараз досяг найвищого рівня».</em></p>
                        <Link to="/" className="news--link">Читати далі...</Link>
                    </article>
                    <article className="news--article">
                        <div className="news--title">ЯК ПРОГРАМУ ІОТ ПРЕЗЕНТУВАЛИ АБІТУРІЄНТАМ</div>
                        <img src="/images/2.png" alt="" />
                        <p>29 квітня у Національному університеті “Львівська політехніка” пройшов День відкритих
                        дверей бакалаврської програми “Інтернет речей”. Абітурієнти мали нагоду дізнатися усі деталі
                        про навчання на інноваційній програмі ІоТ та побачити реальні пристрої створені на базі
                        Інтернету речей.</p>
                        <p>Зеновій Верес, співзасновник програми ІоТ, к.т.н., асистент кафедри Комп’ютеризованих систем
                         автоматики познайомив майбутніх студентів з особливостями навчання, презентації та реалізацію
                         власних проектів студентами попереднього року навчання. Також наголосив на тому, що з вересня
                         цього року, в програми ІоТ з’явиться своя власна лабораторія, яка дозволить студентам
                         експериментувати та творити власні «розумні» пристрої.</p>
                        <p>Співзасновник програми, к.т.н., асистент кафедри Комп’ютеризованих систем автоматики
                        Володимир Федак розповів про предмети, які викладаються на програмі ІоТ, також про те як багато
                        уваги на програмі приділяють розвиткові soft skills.</p>
                        <p>Про те як працюють і створюються гаджети на основі Інтернету речей, студентам розповіли
                        розробники Senstone. Дизайнер найвідомішого львівського стартапу Віталій Кирилів розповів
                        про дизайн пристрою, його особливості та філософію.</p>
                        <Link to="/" className="news--link">Читати далі...</Link>
                    </article>
                </section>
            </div>
        )
    }
}
